import tkinter
import math
import random

password = ""
alphabet = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "э", "ь", "э", "ю", "я", "`", "~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "-", "+", "=", "{", "}", "[", "]", "\\", "|", ":", ";", "\"", "'", "<", ">", ",", ".", "?", "/"]
P = math.pow(10, -5)
V = 10
T = 30 # 1 месяц = 30 дней, T указываем в днях
A = 33 + 32 # буквы от а до я (их 33) и 32 спец. символов

S_min = (V * T) / P
L = 1 # переменная для вычисления длины генерируемого пароля
S = 0 # число всевозможных паролей длины L, которые можно составить из символов алфавита A
while True: # цикл для вычисления длины пароля
    if (S_min <= math.pow(A, L)):
        S = math.pow(A, L)
        break
    L += 1

for i in range(L): #цикл для генерации пароля
    password += alphabet[random.randint(0, len(alphabet) - 1)]

print("Сгенерированный пароль - \"", password, "\"")